In [64]:
import pandas as pd
import numpy as np

In [65]:
data=np.random.randint(3,17,(4,3))

In [66]:
data

array([[15, 15,  3],
       [14,  9,  8],
       [ 4,  9, 13],
       [16, 10,  9]])

# pandas ile tablolama

In [67]:
dataFrame=pd.DataFrame(data)

In [68]:
dataFrame

    0   1   2
0  15  15   3
1  14   9   8
2   4   9  13
3  16  10   9

In [69]:
dataFrame[0]

0    15
1    14
2     4
3    16
Name: 0, dtype: int32

In [70]:
yeniDataFrame=pd.DataFrame(data,index=["Ali","Veli","Hasan","Hüseyin"],columns=["YAŞ","BOY","KİLO"])

In [71]:
yeniDataFrame

         YAŞ  BOY  KİLO
Ali       15   15     3
Veli      14    9     8
Hasan      4    9    13
Hüseyin   16   10     9

In [72]:
yeniDataFrame["YAŞ"]

Ali        15
Veli       14
Hasan       4
Hüseyin    16
Name: YAŞ, dtype: int32

In [73]:
yeniDataFrame[["YAŞ","KİLO"]]

         YAŞ  KİLO
Ali       15     3
Veli      14     8
Hasan      4    13
Hüseyin   16     9

### Satır çağırma

In [74]:
yeniDataFrame.loc["Ali"]

YAŞ     15
BOY     15
KİLO     3
Name: Ali, dtype: int32

In [75]:
yeniDataFrame.iloc[0]

YAŞ     15
BOY     15
KİLO     3
Name: Ali, dtype: int32

# ekleme ve çıkarma

In [76]:
yeniDataFrame["EN"]=yeniDataFrame["BOY"]/2

In [77]:
yeniDataFrame

         YAŞ  BOY  KİLO   EN
Ali       15   15     3  7.5
Veli      14    9     8  4.5
Hasan      4    9    13  4.5
Hüseyin   16   10     9  5.0

In [78]:
yeniDataFrame.drop("EN",axis=1)

         YAŞ  BOY  KİLO
Ali       15   15     3
Veli      14    9     8
Hasan      4    9    13
Hüseyin   16   10     9

In [79]:
yeniDataFrame.drop("Hasan",axis=0)

         YAŞ  BOY  KİLO   EN
Ali       15   15     3  7.5
Veli      14    9     8  4.5
Hüseyin   16   10     9  5.0

In [80]:
yeniDataFrame

         YAŞ  BOY  KİLO   EN
Ali       15   15     3  7.5
Veli      14    9     8  4.5
Hasan      4    9    13  4.5
Hüseyin   16   10     9  5.0

In [81]:
yeniDataFrame.drop("EN",axis=1,inplace=True)

In [82]:
yeniDataFrame.drop("Hasan",axis=0,inplace=True)

In [83]:
yeniDataFrame

         YAŞ  BOY  KİLO
Ali       15   15     3
Veli      14    9     8
Hüseyin   16   10     9

In [84]:
yeniDataFrame<7

           YAŞ    BOY   KİLO
Ali      False  False   True
Veli     False  False  False
Hüseyin  False  False  False

In [85]:
yeniDataFrame["YAŞ"]<7

Ali        False
Veli       False
Hüseyin    False
Name: YAŞ, dtype: bool

In [86]:
boolenFrame=yeniDataFrame<7

In [87]:
boolenFrame

           YAŞ    BOY   KİLO
Ali      False  False   True
Veli     False  False  False
Hüseyin  False  False  False

In [88]:
yeniDataFrame[boolenFrame]

         YAŞ  BOY  KİLO
Ali      NaN  NaN   3.0
Veli     NaN  NaN   NaN
Hüseyin  NaN  NaN   NaN

In [89]:
yeniDataFrame[yeniDataFrame<7]

         YAŞ  BOY  KİLO
Ali      NaN  NaN   3.0
Veli     NaN  NaN   NaN
Hüseyin  NaN  NaN   NaN

In [90]:
yeniDataFrame[yeniDataFrame["YAŞ"]<7]

Empty DataFrame
Columns: [YAŞ, BOY, KİLO]
Index: []

# index

In [91]:
yeniDataFrame.reset_index()

     index  YAŞ  BOY  KİLO
0      Ali   15   15     3
1     Veli   14    9     8
2  Hüseyin   16   10     9

In [92]:
 yeniIndexListesi=["al","ve","hü"]

In [93]:
yeniDataFrame["yeni index"]=yeniIndexListesi

In [94]:
yeniDataFrame

         YAŞ  BOY  KİLO yeni index
Ali       15   15     3         al
Veli      14    9     8         ve
Hüseyin   16   10     9         hü

In [95]:
yeniDataFrame.set_index("yeni index",inplace=True)

In [96]:
yeniDataFrame

            YAŞ  BOY  KİLO
yeni index
al           15   15     3
ve           14    9     8
hü           16   10     9

# Multi Index

In [97]:
ilkIndexler=["ALK","ALK","ALK","bb","bb","bb",]

In [98]:
icIndexler=["Yusuf","Vaide","Üç","aa","aa","aa"]

In [99]:
birlesmisIndex=list(zip(ilkIndexler,icIndexler))

In [100]:
birlesmisIndex

[('ALK', 'Yusuf'),
 ('ALK', 'Vaide'),
 ('ALK', 'Üç'),
 ('bb', 'aa'),
 ('bb', 'aa'),
 ('bb', 'aa')]

In [101]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [102]:
birlesmisIndex

MultiIndex([('ALK', 'Yusuf'),
            ('ALK', 'Vaide'),
            ('ALK',    'Üç'),
            ( 'bb',    'aa'),
            ( 'bb',    'aa'),
            ( 'bb',    'aa')],
           )

In [103]:
benimListem=[["46","Y"],["43","V"],["20","İ"],["1","a"],["2","z"],["4","v"]]

In [104]:
benimArray=np.array(benimListem)

In [105]:
benimDataFrame2=pd.DataFrame(benimArray,index=birlesmisIndex,columns=["Yaş","İsim"])

In [106]:
benimDataFrame2

          Yaş İsim
ALK Yusuf  46    Y
    Vaide  43    V
    Üç     20    İ
bb  aa      1    a
    aa      2    z
    aa      4    v

In [107]:
benimDataFrame2.loc["ALK"]

      Yaş İsim
Yusuf  46    Y
Vaide  43    V
Üç     20    İ

In [108]:
benimDataFrame2.loc["ALK"].loc["Üç"]

Yaş     20
İsim     İ
Name: Üç, dtype: object

In [109]:
benimDataFrame2.index.names=["Soyisim","İsim"]

In [110]:
benimDataFrame2

              Yaş İsim
Soyisim İsim
ALK     Yusuf  46    Y
        Vaide  43    V
        Üç     20    İ
bb      aa      1    a
        aa      2    z
        aa      4    v